import React from 'react';
import './AboutPage.css'

function AboutPage() {
    return (
        <div className='about_root'>
            {/*загаловок из этого типо слайдера*/}
            <h1>Строительная компания “Канадские дома”</h1>
            <div>
                <div>
                    <h3>Мы производственно-строительная компания</h3>
                    <p>Компания ООО «Канадские дома» основана в 2011 году. Наша компания работает в сегменте малоэтажного строительства в Калининградской области с физическими и юридическими лицами. Наши клиенты могут заказать как маленький садовый домик так и большой, красивый элитный дом, – которые будут построены грамотно, качественно и в кратчайшие сроки. На все выполненные подряды по строительству мы несем гарантийные обязательства согласно нашим договорам.</p>
                    <p>С нами удобно работать т.к. мы закрываем большой спектр оказываемых услуг в одном окне, начиная от первичной консультации и выезда на участок для осмотра строй площадки, подъездных путей, наличия инженерных сетей, дренажных канав и многое другое, до составления полного пакета документов (включающих в себя работу над проектом дома) для подачи в банк на строительство под ипотеку.</p>
                </div>
                <div>

                </div>
            </div>
        </div>
    );
}

export default AboutPage;